Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32091C-EVAL.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                      |I2C1|I2C2|SPI1 |SPI2 |USART1|USART2|USART3|USART4|USART5|USART6|USART7|USART8|TIM (PWM)                                 |RCC       |SYS   
PA0 , // |JOY_SEL                          |    |    |     |     |      |      |      |*TX   |      |      |      |      |*TIM2_CH1                                 |          |      
PA1 , // |LDR_OUT [R1 PhotoCell]           |    |    |     |     |      |      |      |*RX   |      |      |      |      |*TIM15_CH1N *TIM2_CH2                     |          |      
PA2 , // |SmartCard_IO [ST8024L_IOUC]      |    |    |     |     |      |*TX   |      |      |      |      |      |      |*TIM2_CH3 +TIM15_CH1                      |          |      
PA3 , // |SmartCard_RST [ST8024L_RSTIN]    |    |    |     |     |      |*RX   |      |      |      |      |      |      |*TIM2_CH4 +TIM15_CH2                      |          |      
PA4 , // |AUDIO_OUT_L [TS488_VIN1]         |    |    |     |     |      |      |      |      |      |+TX   |      |      |*TIM14_CH1                                |          |      
PA5 , // |                                 |    |    |*SCK |     |      |      |      |      |      |+RX   |      |      |+TIM2_CH1                                 |          |      
PA6 , // |Audio_IN                         |    |    |*MISO|     |      |      |      |      |      |      |      |      |+TIM3_CH1 *TIM16_CH1                      |          |      
PA7 , // |SmartCard_CMDVCC [ST8024L_CMDVCC]|    |    |*MOSI|     |      |      |      |      |      |      |      |      |*TIM1_CH1N +TIM3_CH2 +TIM14_CH1 *TIM17_CH1|          |      
PA8 , // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |+TIM1_CH1                                 |          |      
PA9 , // |USART1_TX [ST3241_T2IN]          |+SCL|    |     |     |*TX   |      |      |      |      |      |      |      |+TIM1_CH2                                 |          |      
PA10, // |USART1_RX [ST3241_R3OUT]         |+SDA|    |     |     |*RX   |      |      |      |      |      |      |      |+TIM1_CH3                                 |          |      
PA11, // |USART1_CTS [ST3241_R4OUT]        |    |+SCL|     |     |      |      |      |      |      |      |      |      |+TIM1_CH4                                 |          |      
PA12, // |USART1_RTS [ST3241_T1IN]         |    |+SDA|     |     |      |      |      |      |      |      |      |      |                                          |          |      
PA13, // |SWDAT                            |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |*SWDIO
PA14, // |SWCLK                            |    |    |     |     |      |+TX   |      |      |      |      |      |      |                                          |          |*SWCLK
PA15, // |                                 |    |    |     |     |      |+RX   |      |      |      |      |      |      |+TIM2_CH1                                 |          |      
PB0 , // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |+TIM3_CH3 *TIM1_CH2N                      |          |      
PB1 , // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |*TIM1_CH3N +TIM14_CH1 +TIM3_CH4           |          |      
PB2 , // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PB3 , // |                                 |    |    |+SCK |     |      |      |      |      |+TX   |      |      |      |+TIM2_CH2                                 |          |      
PB4 , // |                                 |    |    |+MISO|     |      |      |      |      |+RX   |      |      |      |+TIM3_CH1                                 |          |      
PB5 , // |TempSensor_INT [STLM75_OS/INT]   |    |    |+MOSI|     |      |      |      |      |      |      |      |      |+TIM3_CH2                                 |          |      
PB6 , // |I2C1_SCL[STM75/CN2_SCL]          |+SCL|    |     |     |+TX   |      |      |      |      |      |      |      |*TIM16_CH1N                               |          |      
PB7 , // |I2C1_SDA[STM75/CN2_SDA]          |+SDA|    |     |     |+RX   |      |      |      |      |      |      |      |*TIM17_CH1N                               |          |      
PB8 , // |ACP_RST_OD [CN2_ACP_RST]         |+SCL|    |     |     |      |      |      |      |      |      |      |      |+TIM16_CH1                                |          |      
PB9 , // |IR_OUT [Infrared Led SFH409-2]   |+SDA|    |     |     |      |      |      |      |      |      |      |      |+TIM17_CH1                                |          |      
PB10, // |HDMI_CEC_OD [HDMI_CEC]           |    |*SCL|     |*SCK |      |      |+TX   |      |      |      |      |      |+TIM2_CH3                                 |          |      
PB11, // |SHIELD_CT [Touch_Sensing]        |    |*SDA|     |     |      |      |+RX   |      |      |      |      |      |+TIM2_CH4                                 |          |      
PB12, // |SHIELD [Touch_Sensing]           |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PB13, // |I2C2_SCL [HDMI_SCL]              |    |+SCL|     |+SCK |      |      |      |      |      |      |      |      |+TIM1_CH1N                                |          |      
PB14, // |I2C2_SDA [HDMI_SDA]              |    |+SDA|     |+MISO|      |      |      |      |      |      |      |      |+TIM1_CH2N +TIM15_CH1                     |          |      
PB15, // |                                 |    |    |     |+MOSI|      |      |      |      |      |      |      |      |+TIM1_CH3N +TIM15_CH1N +TIM15_CH2         |          |      
PC0 , // |Potentiometer [RV3]              |    |    |     |     |      |      |      |      |      |+TX   |*TX   |      |                                          |          |      
PC1 , // |SmartCard_1V8 [ST8024L_1V8]      |    |    |     |     |      |      |      |      |      |+RX   |*RX   |      |                                          |          |      
PC2 , // |SmartCard_3/5V [ST8024L_3/5V]    |    |    |     |*MISO|      |      |      |      |      |      |      |*TX   |                                          |          |      
PC3 , // |SmartCard_OFF [ST8024L_OFF]      |    |    |     |*MOSI|      |      |      |      |      |      |      |*RX   |                                          |          |      
PC4 , // |                                 |    |    |     |     |      |      |*TX   |      |      |      |      |      |                                          |          |      
PC5 , // |                                 |    |    |     |     |      |      |*RX   |      |      |      |      |      |                                          |          |      
PC6 , // |IR_IN [TSOP34836]                |    |    |     |     |      |      |      |      |      |      |+TX   |      |+TIM3_CH1                                 |          |      
PC7 , // |                                 |    |    |     |     |      |      |      |      |      |      |+RX   |      |+TIM3_CH2                                 |          |      
PC8 , // |USART8_TX                        |    |    |     |     |      |      |      |      |      |      |      |+TX   |+TIM3_CH3                                 |          |      
PC9 , // |USART8_RX                        |    |    |     |     |      |      |      |      |      |      |      |+RX   |+TIM3_CH4                                 |          |      
PC10, // |USART4_TX                        |    |    |     |     |      |      |+TX   |+TX   |      |      |      |      |                                          |          |      
PC11, // |USART4_RX                        |    |    |     |     |      |      |+RX   |+RX   |      |      |      |      |                                          |          |      
PC12, // |USART5_TX [STLK_RX]              |    |    |     |     |      |      |      |      |+TX   |      |      |      |                                          |          |      
PC13, // |Tamper_Key [B2 PushButton]       |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PC14, // |PC14-OSC32_IN                    |    |    |     |     |      |      |      |      |      |      |      |      |                                          |*OSC32_IN |      
PC15, // |PC15-OSC32_OUT                   |    |    |     |     |      |      |      |      |      |      |      |      |                                          |*OSC32_OUT|      
PD0 , // |CAN_RX [SN65HVD230_R]            |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PD1 , // |CAN_TX [SN65HVD230_D]            |    |    |     |+SCK |      |      |      |      |      |      |      |      |                                          |          |      
PD2 , // |USART5_RX [STLK_TX]              |    |    |     |     |      |      |      |      |+RX   |      |      |      |                                          |          |      
PD3 , // |                                 |    |    |     |+MISO|      |      |      |      |      |      |      |      |                                          |          |      
PD4 , // |                                 |    |    |     |+MOSI|      |      |      |      |      |      |      |      |                                          |          |      
PD5 , // |                                 |    |    |     |     |      |+TX   |      |      |      |      |      |      |                                          |          |      
PD6 , // |                                 |    |    |     |     |      |+RX   |      |      |      |      |      |      |                                          |          |      
PD7 , // |SmartCard_CLK [ST8024L_XTAL1]    |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PD8 , // |USART3_TX                        |    |    |     |     |      |      |+TX   |      |      |      |      |      |                                          |          |      
PD9 , // |USART3_RX                        |    |    |     |     |      |      |+RX   |      |      |      |      |      |                                          |          |      
PD10, // |HDMI_HPD_Source [HDMI_Source]    |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PD11, // |HDMI_HDP_SINK_OD [HDMI_Sink]     |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PD12, // |TS1 [Touch_Sensing]              |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PD13, // |TS2 [Touch_Sensing]              |    |    |     |     |      |      |      |      |      |      |      |+TX   |                                          |          |      
PD14, // |TS_CT [Touch_Sensing]            |    |    |     |     |      |      |      |      |      |      |      |+RX   |                                          |          |      
PD15, // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PE0 , // |LED1 [Green Led]                 |    |    |     |     |      |      |      |      |      |      |      |      |+TIM16_CH1                                |          |      
PE1 , // |LED2 [Orange Led]                |    |    |     |     |      |      |      |      |      |      |      |      |+TIM17_CH1                                |          |      
PE2 , // |JOY_LEFT                         |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PE3 , // |JOY_RIGHT                        |    |    |     |     |      |      |      |      |      |      |      |      |*TIM3_CH1                                 |          |      
PE4 , // |JOY_UP                           |    |    |     |     |      |      |      |      |      |      |      |      |*TIM3_CH2                                 |          |      
PE5 , // |JOY_DOWN                         |    |    |     |     |      |      |      |      |      |      |      |      |*TIM3_CH3                                 |          |      
PE6 , // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |*TIM3_CH4                                 |          |      
PE7 , // |LED3 [Red Led]                   |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PE8 , // |LED4 [Blue Led]                  |    |    |     |     |      |      |      |+TX   |      |      |      |      |+TIM1_CH1N                                |          |      
PE9 , // |SPI1_MOSI_DIR [MicroSD_DIR]      |    |    |     |     |      |      |      |+RX   |      |      |      |      |*TIM1_CH1                                 |          |      
PE10, // |LCD_CS_OD [TFTLDC_CS]            |    |    |     |     |      |      |      |      |*TX   |      |      |      |+TIM1_CH2N                                |          |      
PE11, // |SDcard_Detect [MicroSD_SW1]      |    |    |     |     |      |      |      |      |*RX   |      |      |      |*TIM1_CH2                                 |          |      
PE12, // |MicroSD_CS_OD [MicroSD_CS]       |    |    |     |     |      |      |      |      |      |      |      |      |+TIM1_CH3N                                |          |      
PE13, // |SPI1_SCK [MicroSD_SCLK]          |    |    |+SCK |     |      |      |      |      |      |      |      |      |*TIM1_CH3                                 |          |      
PE14, // |SPI1_MISO [MicroSD_DO]           |    |    |+MISO|     |      |      |      |      |      |      |      |      |*TIM1_CH4                                 |          |      
PE15, // |SPI1_MOSI [MicroSD_DI]           |    |    |+MOSI|     |      |      |      |      |      |      |      |      |                                          |          |      
PF0 , // |PF0-OSC_IN                       |*SDA|    |     |     |      |      |      |      |      |      |      |      |                                          |*OSC_IN   |      
PF1 , // |PF1-OSC_OUT                      |*SCL|    |     |     |      |      |      |      |      |      |      |      |                                          |*OSC_OUT  |      
PF2 , // |USART7_TX                        |    |    |     |     |      |      |      |      |      |      |+TX   |      |                                          |          |      
PF3 , // |USART7_RX                        |    |    |     |     |      |      |      |      |      |      |+RX   |      |                                          |          |      
PF6 , // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
PF9 , // |USART6_TX                        |    |    |     |     |      |      |      |      |      |*TX   |      |      |*TIM15_CH1                                |          |      
PF10, // |USART6_RX                        |    |    |     |     |      |      |      |      |      |*RX   |      |      |*TIM15_CH2                                |          |      
PF11, // |                                 |    |    |     |     |      |      |      |      |      |      |      |      |                                          |          |      
NB_DIGITAL_PINS,
};

#include "stm32f1xx_hal.h"
#include "spi_com.h"
#include "twi.h"
#include "uart.h"
#include "analog.h"
#include "variant.h"

extern const PinDescription g_APinDescription[]=
{
  { PA0 , GPIO_PIN_0 , GPIOA, GPIO_PIN_IO, false},
  { PA1 , GPIO_PIN_1 , GPIOA, GPIO_PIN_IO, false},
  { PA2 , GPIO_PIN_2 , GPIOA, GPIO_PIN_IO, false},
  { PA3 , GPIO_PIN_3 , GPIOA, GPIO_PIN_IO, false},
  { PA4 , GPIO_PIN_4 , GPIOA, GPIO_PIN_IO, false},
  { PA5 , GPIO_PIN_5 , GPIOA, GPIO_PIN_IO, false},
  { PA6 , GPIO_PIN_6 , GPIOA, GPIO_PIN_IO, false},
  { PA7 , GPIO_PIN_7 , GPIOA, GPIO_PIN_IO, false},
  { PA8 , GPIO_PIN_8 , GPIOA, GPIO_PIN_IO, false},
  { PA9 , GPIO_PIN_9 , GPIOA, GPIO_PIN_IO, false},
  { PA10, GPIO_PIN_10, GPIOA, GPIO_PIN_IO, false},
  { PA11, GPIO_PIN_11, GPIOA, GPIO_PIN_IO, false},
  { PA12, GPIO_PIN_12, GPIOA, GPIO_PIN_IO, false},
  { PA13, GPIO_PIN_13, GPIOA, GPIO_PIN_IO, false},
  { PA14, GPIO_PIN_14, GPIOA, GPIO_PIN_IO, false},
  { PA15, GPIO_PIN_15, GPIOA, GPIO_PIN_IO, false},
  { PB0 , GPIO_PIN_0 , GPIOB, GPIO_PIN_IO, false},
  { PB1 , GPIO_PIN_1 , GPIOB, GPIO_PIN_IO, false},
  { PB2 , GPIO_PIN_2 , GPIOB, GPIO_PIN_IO, false},
  { PB3 , GPIO_PIN_3 , GPIOB, GPIO_PIN_IO, false},
  { PB4 , GPIO_PIN_4 , GPIOB, GPIO_PIN_IO, false},
  { PB5 , GPIO_PIN_5 , GPIOB, GPIO_PIN_IO, false},
  { PB6 , GPIO_PIN_6 , GPIOB, GPIO_PIN_IO, false},
  { PB7 , GPIO_PIN_7 , GPIOB, GPIO_PIN_IO, false},
  { PB8 , GPIO_PIN_8 , GPIOB, GPIO_PIN_IO, false},
  { PB9 , GPIO_PIN_9 , GPIOB, GPIO_PIN_IO, false},
  { PB10, GPIO_PIN_10, GPIOB, GPIO_PIN_IO, false},
  { PB11, GPIO_PIN_11, GPIOB, GPIO_PIN_IO, false},
  { PB12, GPIO_PIN_12, GPIOB, GPIO_PIN_IO, false},
  { PB13, GPIO_PIN_13, GPIOB, GPIO_PIN_IO, false},
  { PB14, GPIO_PIN_14, GPIOB, GPIO_PIN_IO, false},
  { PB15, GPIO_PIN_15, GPIOB, GPIO_PIN_IO, false},
  { PC0 , GPIO_PIN_0 , GPIOC, GPIO_PIN_IO, false},
  { PC1 , GPIO_PIN_1 , GPIOC, GPIO_PIN_IO, false},
  { PC2 , GPIO_PIN_2 , GPIOC, GPIO_PIN_IO, false},
  { PC3 , GPIO_PIN_3 , GPIOC, GPIO_PIN_IO, false},
  { PC4 , GPIO_PIN_4 , GPIOC, GPIO_PIN_IO, false},
  { PC5 , GPIO_PIN_5 , GPIOC, GPIO_PIN_IO, false},
  { PC6 , GPIO_PIN_6 , GPIOC, GPIO_PIN_IO, false},
  { PC7 , GPIO_PIN_7 , GPIOC, GPIO_PIN_IO, false},
  { PC8 , GPIO_PIN_8 , GPIOC, GPIO_PIN_IO, false},
  { PC9 , GPIO_PIN_9 , GPIOC, GPIO_PIN_IO, false},
  { PC10, GPIO_PIN_10, GPIOC, GPIO_PIN_IO, false},
  { PC11, GPIO_PIN_11, GPIOC, GPIO_PIN_IO, false},
  { PC12, GPIO_PIN_12, GPIOC, GPIO_PIN_IO, false},
  { PC13, GPIO_PIN_13, GPIOC, GPIO_PIN_IO, false},
  { PC14, GPIO_PIN_14, GPIOC, GPIO_PIN_IO, false},
  { PC15, GPIO_PIN_15, GPIOC, GPIO_PIN_IO, false},
  { PD0 , GPIO_PIN_0 , GPIOD, GPIO_PIN_IO, false},
  { PD1 , GPIO_PIN_1 , GPIOD, GPIO_PIN_IO, false},
  { PD2 , GPIO_PIN_2 , GPIOD, GPIO_PIN_IO, false},
  { PD3 , GPIO_PIN_3 , GPIOD, GPIO_PIN_IO, false},
  { PD4 , GPIO_PIN_4 , GPIOD, GPIO_PIN_IO, false},
  { PD5 , GPIO_PIN_5 , GPIOD, GPIO_PIN_IO, false},
  { PD6 , GPIO_PIN_6 , GPIOD, GPIO_PIN_IO, false},
  { PD7 , GPIO_PIN_7 , GPIOD, GPIO_PIN_IO, false},
  { PD8 , GPIO_PIN_8 , GPIOD, GPIO_PIN_IO, false},
  { PD9 , GPIO_PIN_9 , GPIOD, GPIO_PIN_IO, false},
  { PD10, GPIO_PIN_10, GPIOD, GPIO_PIN_IO, false},
  { PD11, GPIO_PIN_11, GPIOD, GPIO_PIN_IO, false},
  { PD12, GPIO_PIN_12, GPIOD, GPIO_PIN_IO, false},
  { PD13, GPIO_PIN_13, GPIOD, GPIO_PIN_IO, false},
  { PD14, GPIO_PIN_14, GPIOD, GPIO_PIN_IO, false},
  { PD15, GPIO_PIN_15, GPIOD, GPIO_PIN_IO, false},
  { PE0 , GPIO_PIN_0 , GPIOE, GPIO_PIN_IO, false},
  { PE1 , GPIO_PIN_1 , GPIOE, GPIO_PIN_IO, false},
  { PE2 , GPIO_PIN_2 , GPIOE, GPIO_PIN_IO, false},
  { PE3 , GPIO_PIN_3 , GPIOE, GPIO_PIN_IO, false},
  { PE4 , GPIO_PIN_4 , GPIOE, GPIO_PIN_IO, false},
  { PE5 , GPIO_PIN_5 , GPIOE, GPIO_PIN_IO, false},
  { PE6 , GPIO_PIN_6 , GPIOE, GPIO_PIN_IO, false},
  { PE7 , GPIO_PIN_7 , GPIOE, GPIO_PIN_IO, false},
  { PE8 , GPIO_PIN_8 , GPIOE, GPIO_PIN_IO, false},
  { PE9 , GPIO_PIN_9 , GPIOE, GPIO_PIN_IO, false},
  { PE10, GPIO_PIN_10, GPIOE, GPIO_PIN_IO, false},
  { PE11, GPIO_PIN_11, GPIOE, GPIO_PIN_IO, false},
  { PE12, GPIO_PIN_12, GPIOE, GPIO_PIN_IO, false},
  { PE13, GPIO_PIN_13, GPIOE, GPIO_PIN_IO, false},
  { PE14, GPIO_PIN_14, GPIOE, GPIO_PIN_IO, false},
  { PE15, GPIO_PIN_15, GPIOE, GPIO_PIN_IO, false},
  { PF0 , GPIO_PIN_0 , GPIOF, GPIO_PIN_IO, false},
  { PF1 , GPIO_PIN_1 , GPIOF, GPIO_PIN_IO, false},
  { PF2 , GPIO_PIN_2 , GPIOF, GPIO_PIN_IO, false},
  { PF3 , GPIO_PIN_3 , GPIOF, GPIO_PIN_IO, false},
  { PF6 , GPIO_PIN_6 , GPIOF, GPIO_PIN_IO, false},
  { PF9 , GPIO_PIN_9 , GPIOF, GPIO_PIN_IO, false},
  { PF10, GPIO_PIN_10, GPIOF, GPIO_PIN_IO, false},
  { PF11, GPIO_PIN_11, GPIOF, GPIO_PIN_IO, false},
};



spi_init_info_t spi_init_info[] = { 
  { 
    .init_done = 0, 
    .spi_instance = SPI1, 
    .mosi_alternate = GPIO_AF0_SPI1,
    .mosi_port = GPIOA, 
    .mosi_pin =  GPIO_PIN_7, 
    .miso_alternate = GPIO_AF0_SPI1,
    .miso_port = GPIOA, 
    .miso_pin = GPIO_PIN_6, 
    .sck_alternate = GPIO_AF0_SPI1,
    .sck_port = GPIOA, 
    .sck_pin = GPIO_PIN_5, 
  },
  { 
    .init_done = 0, 
    .spi_instance = SPI2, 
    .mosi_alternate = GPIO_AF1_SPI2,
    .mosi_port = GPIOC, 
    .mosi_pin =  GPIO_PIN_3, 
    .miso_alternate = GPIO_AF1_SPI2,
    .miso_port = GPIOC, 
    .miso_pin = GPIO_PIN_2, 
    .sck_alternate = GPIO_AF5_SPI2,
    .sck_port = GPIOB, 
    .sck_pin = GPIO_PIN_10, 
  },
}; 

uint8_t NB_SPI_INSTANCES = sizeof(spi_init_info) / sizeof(spi_init_info[0]);

i2c_init_info_t g_i2c_init_info[] = {
  {
    .init_done = 0,
    .i2c_instance = I2C1,
    .irq = I2C1_EV_IRQn,
    .sda_alternate = GPIO_AF1_I2C1,
    .sda_port = GPIOF,
    .sda_pin = GPIO_PIN_0,
    .scl_alternate = GPIO_AF1_I2C1,
    .scl_port = GPIOF,
    .scl_pin = GPIO_PIN_1,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
  {
    .init_done = 0,
    .i2c_instance = I2C2,
    .irq = I2C2_EV_IRQn,
    .sda_alternate = GPIO_AF1_I2C2,
    .sda_port = GPIOB,
    .sda_pin = GPIO_PIN_11,
    .scl_alternate = GPIO_AF1_I2C2,
    .scl_port = GPIOB,
    .scl_pin = GPIO_PIN_10,
    .i2c_onSlaveReceive = NULL,
    .i2c_onSlaveTransmit = NULL,
    .i2cTxRxBufferSize = 0
  },
};

uint8_t NB_I2C_INSTANCES = sizeof(g_i2c_init_info) / sizeof(g_i2c_init_info[0]);


