Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32091C-EVAL.c
remaps_t remaps {
    { I2C1  , SCL  , GPIOF, GPIO_PIN_1  , GPIO_AF1_I2C1                      },
    { I2C1  , SCL  , GPIOA, GPIO_PIN_9  , GPIO_AF4_I2C1                      },
    { I2C1  , SCL  , GPIOB, GPIO_PIN_6  , GPIO_AF1_I2C1                      },
    { I2C1  , SCL  , GPIOB, GPIO_PIN_8  , GPIO_AF1_I2C1                      },
    { I2C1  , SDA  , GPIOF, GPIO_PIN_0  , GPIO_AF1_I2C1                      },
    { I2C1  , SDA  , GPIOA, GPIO_PIN_10 , GPIO_AF4_I2C1                      },
    { I2C1  , SDA  , GPIOB, GPIO_PIN_9  , GPIO_AF1_I2C1                      },
    { I2C1  , SDA  , GPIOB, GPIO_PIN_7  , GPIO_AF1_I2C1                      },
    { I2C2  , SCL  , GPIOB, GPIO_PIN_10 , GPIO_AF1_I2C2                      },
    { I2C2  , SCL  , GPIOB, GPIO_PIN_13 , GPIO_AF5_I2C2                      },
    { I2C2  , SCL  , GPIOA, GPIO_PIN_11 , GPIO_AF5_I2C2                      },
    { I2C2  , SDA  , GPIOA, GPIO_PIN_12 , GPIO_AF5_I2C2                      },
    { I2C2  , SDA  , GPIOB, GPIO_PIN_11 , GPIO_AF1_I2C2                      },
    { I2C2  , SDA  , GPIOB, GPIO_PIN_14 , GPIO_AF5_I2C2                      },
    { SPI1  , MISO , GPIOB, GPIO_PIN_4  , GPIO_AF0_SPI1                      },
    { SPI1  , MISO , GPIOE, GPIO_PIN_14 , GPIO_AF1_SPI1                      },
    { SPI1  , MISO , GPIOA, GPIO_PIN_6  , GPIO_AF0_SPI1                      },
    { SPI1  , MOSI , GPIOB, GPIO_PIN_5  , GPIO_AF0_SPI1                      },
    { SPI1  , MOSI , GPIOE, GPIO_PIN_15 , GPIO_AF1_SPI1                      },
    { SPI1  , MOSI , GPIOA, GPIO_PIN_7  , GPIO_AF0_SPI1                      },
    { SPI1  , SCK  , GPIOA, GPIO_PIN_5  , GPIO_AF0_SPI1                      },
    { SPI1  , SCK  , GPIOB, GPIO_PIN_3  , GPIO_AF0_SPI1                      },
    { SPI1  , SCK  , GPIOE, GPIO_PIN_13 , GPIO_AF1_SPI1                      },
    { SPI2  , MISO , GPIOC, GPIO_PIN_2  , GPIO_AF1_SPI2                      },
    { SPI2  , MISO , GPIOD, GPIO_PIN_3  , GPIO_AF1_SPI2                      },
    { SPI2  , MISO , GPIOB, GPIO_PIN_14 , GPIO_AF0_SPI2                      },
    { SPI2  , MOSI , GPIOC, GPIO_PIN_3  , GPIO_AF1_SPI2                      },
    { SPI2  , MOSI , GPIOD, GPIO_PIN_4  , GPIO_AF1_SPI2                      },
    { SPI2  , MOSI , GPIOB, GPIO_PIN_15 , GPIO_AF0_SPI2                      },
    { SPI2  , SCK  , GPIOB, GPIO_PIN_10 , GPIO_AF5_SPI2                      },
    { SPI2  , SCK  , GPIOB, GPIO_PIN_13 , GPIO_AF0_SPI2                      },
    { SPI2  , SCK  , GPIOD, GPIO_PIN_1  , GPIO_AF1_SPI2                      },
    { TIM14 , CH1  , GPIOB, GPIO_PIN_1  , GPIO_AF0_TIM14                     },
    { TIM14 , CH1  , GPIOA, GPIO_PIN_4  , GPIO_AF4_TIM14                     },
    { TIM14 , CH1  , GPIOA, GPIO_PIN_7  , GPIO_AF4_TIM14                     },
    { TIM15 , CH1  , GPIOF, GPIO_PIN_9  , GPIO_AF0_TIM15                     },
    { TIM15 , CH1  , GPIOA, GPIO_PIN_2  , GPIO_AF0_TIM15                     },
    { TIM15 , CH1  , GPIOB, GPIO_PIN_14 , GPIO_AF1_TIM15                     },
    { TIM15 , CH1N , GPIOA, GPIO_PIN_1  , GPIO_AF5_TIM15                     },
    { TIM15 , CH1N , GPIOB, GPIO_PIN_15 , GPIO_AF3_TIM15                     },
    { TIM15 , CH2  , GPIOA, GPIO_PIN_3  , GPIO_AF0_TIM15                     },
    { TIM15 , CH2  , GPIOB, GPIO_PIN_15 , GPIO_AF1_TIM15                     },
    { TIM15 , CH2  , GPIOF, GPIO_PIN_10 , GPIO_AF0_TIM15                     },
    { TIM16 , CH1  , GPIOE, GPIO_PIN_0  , GPIO_AF0_TIM16                     },
    { TIM16 , CH1  , GPIOB, GPIO_PIN_8  , GPIO_AF2_TIM16                     },
    { TIM16 , CH1  , GPIOA, GPIO_PIN_6  , GPIO_AF5_TIM16                     },
    { TIM16 , CH1N , GPIOB, GPIO_PIN_6  , GPIO_AF2_TIM16                     },
    { TIM17 , CH1  , GPIOB, GPIO_PIN_9  , GPIO_AF2_TIM17                     },
    { TIM17 , CH1  , GPIOE, GPIO_PIN_1  , GPIO_AF0_TIM17                     },
    { TIM17 , CH1  , GPIOA, GPIO_PIN_7  , GPIO_AF5_TIM17                     },
    { TIM17 , CH1N , GPIOB, GPIO_PIN_7  , GPIO_AF2_TIM17                     },
    { TIM1  , CH1  , GPIOA, GPIO_PIN_8  , GPIO_AF2_TIM1                      },
    { TIM1  , CH1  , GPIOE, GPIO_PIN_9  , GPIO_AF0_TIM1                      },
    { TIM1  , CH1N , GPIOB, GPIO_PIN_13 , GPIO_AF2_TIM1                      },
    { TIM1  , CH1N , GPIOE, GPIO_PIN_8  , GPIO_AF0_TIM1                      },
    { TIM1  , CH1N , GPIOA, GPIO_PIN_7  , GPIO_AF2_TIM1                      },
    { TIM1  , CH2  , GPIOA, GPIO_PIN_9  , GPIO_AF2_TIM1                      },
    { TIM1  , CH2  , GPIOE, GPIO_PIN_11 , GPIO_AF0_TIM1                      },
    { TIM1  , CH2N , GPIOB, GPIO_PIN_0  , GPIO_AF2_TIM1                      },
    { TIM1  , CH2N , GPIOE, GPIO_PIN_10 , GPIO_AF0_TIM1                      },
    { TIM1  , CH2N , GPIOB, GPIO_PIN_14 , GPIO_AF2_TIM1                      },
    { TIM1  , CH3  , GPIOA, GPIO_PIN_10 , GPIO_AF2_TIM1                      },
    { TIM1  , CH3  , GPIOE, GPIO_PIN_13 , GPIO_AF0_TIM1                      },
    { TIM1  , CH3N , GPIOB, GPIO_PIN_15 , GPIO_AF2_TIM1                      },
    { TIM1  , CH3N , GPIOB, GPIO_PIN_1  , GPIO_AF2_TIM1                      },
    { TIM1  , CH3N , GPIOE, GPIO_PIN_12 , GPIO_AF0_TIM1                      },
    { TIM1  , CH4  , GPIOE, GPIO_PIN_14 , GPIO_AF0_TIM1                      },
    { TIM1  , CH4  , GPIOA, GPIO_PIN_11 , GPIO_AF2_TIM1                      },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_0  , GPIO_AF2_TIM2                      },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_5  , GPIO_AF2_TIM2                      },
    { TIM2  , CH1  , GPIOA, GPIO_PIN_15 , GPIO_AF2_TIM2                      },
    { TIM2  , CH2  , GPIOA, GPIO_PIN_1  , GPIO_AF2_TIM2                      },
    { TIM2  , CH2  , GPIOB, GPIO_PIN_3  , GPIO_AF2_TIM2                      },
    { TIM2  , CH3  , GPIOB, GPIO_PIN_10 , GPIO_AF2_TIM2                      },
    { TIM2  , CH3  , GPIOA, GPIO_PIN_2  , GPIO_AF2_TIM2                      },
    { TIM2  , CH4  , GPIOB, GPIO_PIN_11 , GPIO_AF2_TIM2                      },
    { TIM2  , CH4  , GPIOA, GPIO_PIN_3  , GPIO_AF2_TIM2                      },
    { TIM3  , CH1  , GPIOB, GPIO_PIN_4  , GPIO_AF1_TIM3                      },
    { TIM3  , CH1  , GPIOC, GPIO_PIN_6  , GPIO_AF0_TIM3                      },
    { TIM3  , CH1  , GPIOA, GPIO_PIN_6  , GPIO_AF1_TIM3                      },
    { TIM3  , CH1  , GPIOE, GPIO_PIN_3  , GPIO_AF0_TIM3                      },
    { TIM3  , CH2  , GPIOB, GPIO_PIN_5  , GPIO_AF1_TIM3                      },
    { TIM3  , CH2  , GPIOE, GPIO_PIN_4  , GPIO_AF0_TIM3                      },
    { TIM3  , CH2  , GPIOC, GPIO_PIN_7  , GPIO_AF0_TIM3                      },
    { TIM3  , CH2  , GPIOA, GPIO_PIN_7  , GPIO_AF1_TIM3                      },
    { TIM3  , CH3  , GPIOE, GPIO_PIN_5  , GPIO_AF0_TIM3                      },
    { TIM3  , CH3  , GPIOC, GPIO_PIN_8  , GPIO_AF0_TIM3                      },
    { TIM3  , CH3  , GPIOB, GPIO_PIN_0  , GPIO_AF1_TIM3                      },
    { TIM3  , CH4  , GPIOE, GPIO_PIN_6  , GPIO_AF0_TIM3                      },
    { TIM3  , CH4  , GPIOC, GPIO_PIN_9  , GPIO_AF0_TIM3                      },
    { TIM3  , CH4  , GPIOB, GPIO_PIN_1  , GPIO_AF1_TIM3                      },
    { USART1, RX   , GPIOA, GPIO_PIN_10 , GPIO_AF1_USART1                    },
    { USART1, RX   , GPIOB, GPIO_PIN_7  , GPIO_AF0_USART1                    },
    { USART1, TX   , GPIOA, GPIO_PIN_9  , GPIO_AF1_USART1                    },
    { USART1, TX   , GPIOB, GPIO_PIN_6  , GPIO_AF0_USART1                    },
    { USART2, RX   , GPIOD, GPIO_PIN_6  , GPIO_AF0_USART2                    },
    { USART2, RX   , GPIOA, GPIO_PIN_3  , GPIO_AF1_USART2                    },
    { USART2, RX   , GPIOA, GPIO_PIN_15 , GPIO_AF1_USART2                    },
    { USART2, TX   , GPIOA, GPIO_PIN_2  , GPIO_AF1_USART2                    },
    { USART2, TX   , GPIOD, GPIO_PIN_5  , GPIO_AF0_USART2                    },
    { USART2, TX   , GPIOA, GPIO_PIN_14 , GPIO_AF1_USART2                    },
    { USART3, RX   , GPIOB, GPIO_PIN_11 , GPIO_AF4_USART3                    },
    { USART3, RX   , GPIOC, GPIO_PIN_11 , GPIO_AF1_USART3                    },
    { USART3, RX   , GPIOD, GPIO_PIN_9  , GPIO_AF0_USART3                    },
    { USART3, RX   , GPIOC, GPIO_PIN_5  , GPIO_AF1_USART3                    },
    { USART3, TX   , GPIOB, GPIO_PIN_10 , GPIO_AF4_USART3                    },
    { USART3, TX   , GPIOC, GPIO_PIN_10 , GPIO_AF1_USART3                    },
    { USART3, TX   , GPIOC, GPIO_PIN_4  , GPIO_AF1_USART3                    },
    { USART3, TX   , GPIOD, GPIO_PIN_8  , GPIO_AF0_USART3                    },
    { USART4, RX   , GPIOA, GPIO_PIN_1  , GPIO_AF4_USART4                    },
    { USART4, RX   , GPIOC, GPIO_PIN_11 , GPIO_AF0_USART4                    },
    { USART4, RX   , GPIOE, GPIO_PIN_9  , GPIO_AF1_USART4                    },
    { USART4, TX   , GPIOA, GPIO_PIN_0  , GPIO_AF4_USART4                    },
    { USART4, TX   , GPIOE, GPIO_PIN_8  , GPIO_AF1_USART4                    },
    { USART4, TX   , GPIOC, GPIO_PIN_10 , GPIO_AF0_USART4                    },
    { USART5, RX   , GPIOB, GPIO_PIN_4  , GPIO_AF4_USART5                    },
    { USART5, RX   , GPIOD, GPIO_PIN_2  , GPIO_AF2_USART5                    },
    { USART5, RX   , GPIOE, GPIO_PIN_11 , GPIO_AF1_USART5                    },
    { USART5, TX   , GPIOE, GPIO_PIN_10 , GPIO_AF1_USART5                    },
    { USART5, TX   , GPIOC, GPIO_PIN_12 , GPIO_AF2_USART5                    },
    { USART5, TX   , GPIOB, GPIO_PIN_3  , GPIO_AF4_USART5                    },
    { USART6, RX   , GPIOC, GPIO_PIN_1  , GPIO_AF2_USART6                    },
    { USART6, RX   , GPIOA, GPIO_PIN_5  , GPIO_AF5_USART6                    },
    { USART6, RX   , GPIOF, GPIO_PIN_10 , GPIO_AF1_USART6                    },
    { USART6, TX   , GPIOF, GPIO_PIN_9  , GPIO_AF1_USART6                    },
    { USART6, TX   , GPIOC, GPIO_PIN_0  , GPIO_AF2_USART6                    },
    { USART6, TX   , GPIOA, GPIO_PIN_4  , GPIO_AF5_USART6                    },
    { USART7, RX   , GPIOF, GPIO_PIN_3  , GPIO_AF1_USART7                    },
    { USART7, RX   , GPIOC, GPIO_PIN_1  , GPIO_AF1_USART7                    },
    { USART7, RX   , GPIOC, GPIO_PIN_7  , GPIO_AF1_USART7                    },
    { USART7, TX   , GPIOC, GPIO_PIN_0  , GPIO_AF1_USART7                    },
    { USART7, TX   , GPIOF, GPIO_PIN_2  , GPIO_AF1_USART7                    },
    { USART7, TX   , GPIOC, GPIO_PIN_6  , GPIO_AF1_USART7                    },
    { USART8, RX   , GPIOC, GPIO_PIN_3  , GPIO_AF2_USART8                    },
    { USART8, RX   , GPIOC, GPIO_PIN_9  , GPIO_AF1_USART8                    },
    { USART8, RX   , GPIOD, GPIO_PIN_14 , GPIO_AF0_USART8                    },
    { USART8, TX   , GPIOC, GPIO_PIN_2  , GPIO_AF2_USART8                    },
    { USART8, TX   , GPIOD, GPIO_PIN_13 , GPIO_AF0_USART8                    },
    { USART8, TX   , GPIOC, GPIO_PIN_8  , GPIO_AF1_USART8                    },
};
